ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/FSS_FSAS_ECC_AGGR_5380F000h.xml
<module name="FSAS_ECC_AGGR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="FSAS_ECC_AGGR_REV" acronym="FSAS_ECC_AGGR_REV" offset="0" width="32" description="Revision parameters.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29:28" rwaccess="R"/>
	<bitfield id="MODULE_ID" width="12" begin="27" end="16" resetval="0x1696" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x7" description="RTL version" range="15:11" rwaccess="R"/>
	<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x2" description="Major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom version" range="7:6" rwaccess="R"/>
	<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor version" range="5:0" rwaccess="R"/>
	</register><register id="FSAS_ECC_AGGR_VECTOR" acronym="FSAS_ECC_AGGR_VECTOR" offset="8" width="32" description="ECC Vector Register.">
		<bitfield id="RD_SVBUS_DONE" width="1" begin="24" end="24" resetval="0x0" description="Status to indicate if read on serial VBUS is complete, write of any value will clear this bit." range="24" rwaccess="R/W1TC"/>
	<bitfield id="RD_SVBUS_ADDRESS" width="8" begin="23" end="16" resetval="0x0" description="Read address" range="23:16" rwaccess="R/W"/>
	<bitfield id="RD_SVBUS" width="1" begin="15" end="15" resetval="0x0" description="Write 1 to trigger a read on the serial VBUS" range="15" rwaccess="R/W1TS"/>
	<bitfield id="ECC_VECTOR" width="11" begin="10" end="0" resetval="0x0" description="Value written to select the corresponding ECC RAM for control or status" range="10:0" rwaccess="R/W"/>
	</register><register id="FSAS_ECC_AGGR_STAT" acronym="FSAS_ECC_AGGR_STAT" offset="12" width="32" description="Misc Status.">
		<bitfield id="NUM_RAMS" width="11" begin="10" end="0" resetval="0x1" description="Indicates the number of RAMS serviced by the ECC aggregator" range="10:0" rwaccess="R"/>
	</register><register id="FSAS_ECC_AGGR_RESERVED_SVBUS_j" acronym="FSAS_ECC_AGGR_RESERVED_SVBUS_j" offset="16" width="32" description="Reference other documents that contain the ECC RAM wrapper and EDC controller serial vbus register sets.">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Serial VBUS register data" range="31:0" rwaccess="R/W"/>
	</register><register id="FSAS_ECC_AGGR_SEC_EOI_REG" acronym="FSAS_ECC_AGGR_SEC_EOI_REG" offset="60" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_SEC_STATUS_REG0" acronym="FSAS_ECC_AGGR_SEC_STATUS_REG0" offset="64" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_SEC_ENABLE_SET_REG0" acronym="FSAS_ECC_AGGR_SEC_ENABLE_SET_REG0" offset="128" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="RAMECC_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for ramecc_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_SEC_ENABLE_CLR_REG0" acronym="FSAS_ECC_AGGR_SEC_ENABLE_CLR_REG0" offset="192" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="RAMECC_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for ramecc_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="FSAS_ECC_AGGR_DED_EOI_REG" acronym="FSAS_ECC_AGGR_DED_EOI_REG" offset="316" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="1" begin="0" end="0" resetval="0x0" description="EOI Register" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_DED_STATUS_REG0" acronym="FSAS_ECC_AGGR_DED_STATUS_REG0" offset="320" width="32" description="Interrupt Status Register 0">
		<bitfield id="RAMECC_PEND" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Pending Status for ramecc_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_DED_ENABLE_SET_REG0" acronym="FSAS_ECC_AGGR_DED_ENABLE_SET_REG0" offset="384" width="32" description="Interrupt Enable Set Register 0">
		<bitfield id="RAMECC_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Set Register for ramecc_pend" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_DED_ENABLE_CLR_REG0" acronym="FSAS_ECC_AGGR_DED_ENABLE_CLR_REG0" offset="448" width="32" description="Interrupt Enable Clear Register 0">
		<bitfield id="RAMECC_ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt Enable Clear Register for ramecc_pend" range="0" rwaccess="R/W1TC"/>
	</register><register id="FSAS_ECC_AGGR_AGGR_ENABLE_SET" acronym="FSAS_ECC_AGGR_AGGR_ENABLE_SET" offset="512" width="32" description="AGGR interrupt enable set Register.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable set for svbus timeout errors" range="1" rwaccess="R/W1TS"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable set for parity errors" range="0" rwaccess="R/W1TS"/>
	</register><register id="FSAS_ECC_AGGR_AGGR_ENABLE_CLR" acronym="FSAS_ECC_AGGR_AGGR_ENABLE_CLR" offset="516" width="32" description="AGGR interrupt enable clear Register.">
		<bitfield id="TIMEOUT" width="1" begin="1" end="1" resetval="0x0" description="Interrupt enable clear for svbus timeout errors" range="1" rwaccess="R/W1TC"/>
	<bitfield id="PARITY" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable clear for parity errors" range="0" rwaccess="R/W1TC"/>
	</register><register id="FSAS_ECC_AGGR_AGGR_STATUS_SET" acronym="FSAS_ECC_AGGR_AGGR_STATUS_SET" offset="520" width="32" description="AGGR interrupt status set Register.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="Interrupt status set for svbus timeout errors" range="3:2" rwaccess="R/WI"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="Interrupt status set for parity errors" range="1:0" rwaccess="R/WI"/>
	</register><register id="FSAS_ECC_AGGR_AGGR_STATUS_CLR" acronym="FSAS_ECC_AGGR_AGGR_STATUS_CLR" offset="524" width="32" description="AGGR interrupt status clear Register.">
		<bitfield id="TIMEOUT" width="2" begin="3" end="2" resetval="0x0" description="Interrupt status clear for svbus timeout errors" range="3:2" rwaccess="R/WD"/>
	<bitfield id="PARITY" width="2" begin="1" end="0" resetval="0x0" description="Interrupt status clear for parity errors" range="1:0" rwaccess="R/WD"/>
	</register>
</module>